// laba8.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
////
//
//#include <iostream>
//#include <algorithm>
//
//using namespace std;
//
//int getNum(int* , int, int, int);
//
//int main()
//{
//    setlocale(_X_ALL, "Russian");
//
//    int n, i, c, element;
//    cout << "Введите длинну массива: ";  cin >> n;
//
//    int *arr = new int[n];
//
//    for (i = 0; i < n; i++){ cout << "arr[" << i << "] = "; cin >> arr[i]; }
//        
//
//    cout << "Упорядоченый массив: [";
//    for (i = 0; i < n; i++) { cout << arr[i]; if (i != n - 1)cout << ","; }
//    cout << "]" << endl;
//        
//
//    cout << "Введите элемент искомый элемент с = "; cin >> c;
//
//    if (getNum(arr, c, 0, n - 1) == -1) cout << "Такого элемента в массиве нет" << endl;
//    else  cout << "Номер вашего элемента: " << getNum(arr, c, 0, n -1) << endl;
// 
//    
//    delete[]arr;
//    return 0;
//}
////===============================================================
//int getNum(int *a, int c, int l, int r) 
//{
//    if (l == r) if (a[l] == c) return l;
//                          else return -1;
//    int m = (l + r) / 2;
//    if (a[m] < c) return getNum(a, c, m + 1, r); 
//             else return getNum(a, c, l, m);
//}


#include <iostream>

using namespace std;

int getFunction(double, int, int);

int main() {
	int n,
		d = 0;
	double y = 0.5;
	cout << "Введите число n = "; cin >> n;
	y = getFunction(y, n, (n - 1));
	cout << "y = " << y;
}
int getFunction(double y, int n, int d) {
	if (d == 0) {
		return 1 / (n + y);
	}
	else if (d + 1 == n) {
		//cout << y << " " << n << " " << d << " ";
		return getFunction((1 / (1 + 0.5)), n, d--);
	}
	else {
		y = 1 / (n - d + y);
		return getFunction(y , n, d--);
	}
}
//================================================================
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
