// laba5.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.


// Вариант 2

#include <iostream>

using namespace std;
int main()
{
    setlocale(_X_ALL, "Russian");

    int n, m, k, i, j, 
        num = 1;

    cout << "Input n = "; cin >> n;
    cout << "Input m = "; cin >> m;

    double** array = new double* [n];

    for (i = 0; i < n; i++) {
        array[i] = new double[m];
        for (j = 0; j < m; j++) {
            cout << "array[" << i << "][" << j << "] = ";
            cin >> array[i][j];
        }
    }
    cout << endl;
    for (i = 0; i < n; i++) {
        for (j = 0; j < m; j++)
            cout << array[i][j] << " ";
        cout << endl;
    }
    for (i = 0; i < n; i++) {
        num = 1;
        for (k = 0; k < m - 1; k++)
            if (array[i][k] < array[i][k + 1]) num = 0;
        for (j = 0; j < m; j++) 
            array[i][j] = num;          
    }
    cout << endl;
    for (i = 0; i < n; i++) {
        for (j = 0; j < m; j++)
            cout << array[i][j] << " ";
        cout << endl;
    }
    delete[] array;
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
