// laba5.1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.



// Вариант 2

#include <iostream>

using namespace std;
int main()
{
    setlocale(_X_ALL, "Russian");
    
    int n, m, kol = 0;
    bool isNul = true;

    cout << "Input n = "; cin >> n;
    cout << "Input m = "; cin >> m;

    double** array = new double*[n];

    for (int i = 0; i < n; i++) {
        array[i] = new double[m];
        for (int j = 0; j < m; j++) {
            cout << "array[" << i << "][" << j << "] = ";
            cin >> array[i][j];
        }
    }
    cout << endl;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) 
            cout << array[i][j] << " ";
        cout << endl;
    }
    for (int i = 0; i < m; i++) {
        isNul = true;
        for (int j = 0; j < n; j++) 
            if (array[j][i] == 0) isNul = false;
        if (isNul) kol++;
        cout << endl;
    }

    cout << " Колличество столбцов без нулей: "<< kol << endl;

    for (int i = 0; i < n; i++)
        delete[]array[i];
    delete[] array;
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
