// laba8.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <algorithm>

using namespace std;

int getNum(int* &, int, int c);

int main()
{
    setlocale(_X_ALL, "Russian");

    int n, i, c, element;
    cout << "Введите длинну массива: ";  cin >> n;

    int *arr = new int[n];
    for (i = 0; i < n; i++)
    {
        cout << "arr[" << i << "] = "; cin >> arr[i];
    }
    sort(arr, arr + n);
    cout << "Номер элемента в массиве а = "; cin >> c;

    cout << " Ваш элемент с = " << getNum(arr, n, c) << endl;
    delete[]arr;
    return 0;
}
int getNum(int*& arr, int n, int c) {
    if (n == c)      
        return arr[n];
    return getNum(arr, n - 1, c);
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
