// laba4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <ctime>

using namespace std;
int main()
{
    srand(time(NULL));
    setlocale(LC_ALL, "Rus");

    int k,
        composition = 1,
        number_of_zeros = 0;

    const int n = 5;
    int a[n] = {};

    cout << "Вы сами будете вводить элементы массива: 1 - да, 2 - нет "; cin >> k;

        for (int i = 0; i < n; i++)
        {
            if (k == 1) {
                cout << i << ")"; cin >> a[i];
            }
            else {
                a[i] = rand() % 21;
                cout << a[i] << " ";
            }        
        }

    for (int i = 0; i < n; i++) {
       
        if (a[i] == 0 ) {
            number_of_zeros += 1;
        }
        if (number_of_zeros == 1 && a[i] != 0) {
            composition *= a[i];
        }
         
    }
    if (number_of_zeros != 2 ) {
        cout << "\nError: Нулей нет или всего один 0" << endl;
        return 0;
    }
    cout << "Произведение равно " << composition << endl;
    return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
