// laba4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <ctime>

using namespace std;
int main()
{
    srand(time(NULL));
    setlocale(LC_ALL, "Rus");

    int i,n, *a, p = 1,kol = 0, nom1, nom2;

    cout << "n = "; cin >> n;
    a = new int[n];

    for (int i = 0; i < n; i++)
        {
                cout << "a[" << i << "] = "; cin >> a[i]; 
        }

    for (int i = 0; i < n; i++) 
        if (a[i] == 0 ) 
        {
                          kol++;
                          if (kol == 1)nom1 = i;
                          if (kol == 2)nom2 = i;
        }
    if(kol == 0)cout << "\nError: Нулей нет" << endl;
    else if (kol == 1)cout << "\nError: всего один 0" << endl;
    else if(nom2 == nom1 + 1) cout << "\nError: нет произведения" << endl;
    else 
    {
            for (i = nom1 + 1; i < nom2; i++)p *= a[i];
            cout << "Произведение между 1-ым и 2-ым нулями = " << p << endl;
    }    
    delete[] a;
    return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
