// laba4.4.3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

using namespace std;

void deleteArrayElements(double* &, int&);

int main()
{
    int n;
    cout << "Input n = "; cin >> n;

    double* array = new double[n];

    for (int i = 0; i < n; i++)
    {
        cout << "a["<< i << "] = "; cin >> array[i];
    }

    deleteArrayElements(array, n);
    cout << " массив после удаления повторяющихся элементов" << endl;
    for (int i = 0; i < n; i++)    
        cout << array[i] << " ";
    cout << endl;

    delete[] array;
    return 0;
}

void deleteArrayElements(double* &array,int &n)
{
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++) 
        {
            if (array[i] == array[j] && i != j) 
            {
                for (int m = j; m < n; m++) 
                {
                    array[m] = array[m + 1];
                }                
                n--;
            }
        }
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
