// laba3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>
#include <typeinfo>

using namespace std;
int main()
{   
    setlocale(LC_ALL, "Russian");
    //double a, b, h, y, x, s, w;
    //int k,n;

    //cout << "Введите a = "; cin >> a;
    //cout << "Введите b = "; cin >> b;
    //cout << "Введите h = "; cin >> h;
    //cout << "Введите n = "; cin >> n;


    //cout << "    x        s(x)       y(x)       |y(x) - s(x)|" << endl;
    //for (x = a; x <= b; x += h)
    //{

    //    y = x * atan(x) - log(sqrt(1 + x * x));

    //    s = 0; w = -1;
    //    for (k = 1; k < n; k++)
    //    {
    //        w *= -x * x;
    //        s += w / (2 * k * (2 * k - 1));
    //    }  
    //    printf("   %0.1lf     %f    %f    %11.8lf\n", x, y, s, fabs(y - s));
    //}

    // laba 3.3

    double a, b, h, y, e, s, x, w;
    int k;

    cout << "Введите a = "; cin >> a;
    cout << "Введите b = "; cin >> b;
    cout << "Введите h = "; cin >> h;
    cout << "Введите e = "; cin >> e;

    cout << "  x          y(x)       s(x)    |y(x) - s(x)|    n" << endl;
    for (x = a; x <= b; x += h)
    {
        y = x * atan(x) - log(sqrt(1 + x * x));
        s = 0;  w = -1; k = 0;
        do
        {
            k++;
            w *= -x * x;
            s += w / (2 * k * (2 * k - 1));
        } while (fabs(w / (2 * k * (2 * k - 1))) > e);
        printf(" %4.2lf    %9.6lf   %9.6lf   %9.6lf       %d\n", x, y, s, fabs(y - s), k);
    }

    return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
